app/Controllers/Home.php

SELECT *
FROM `products`
WHERE `name` = 'Tangzu Waner S.G. Jade'
 LIMIT 1
---
    public function index()
    {
        $model = new ProductModel();
        $waner = $model->where('name', 'Tangzu Waner S.G. Jade')->first();