app/Controllers/Login.php

    public function authenticate() {
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sergebarcelon54@gmail.com'
 LIMIT 1