app/Controllers/Products.php

SELECT *
FROM `products`
---
        }

        // Fetch the filtered results
        $data['products'] = $builder->findAll();